//Вывести на экран слово “JAVA”, в строку, чтобы оно повторилось 10 раз, используя цикл for.
//Вывод в консоль должен быть таким:
//JAVA JAVA JAVA JAVA JAVA JAVA JAVA JAVA JAVA JAVA

public class Task4 {
    public static void main(String[] args) {
        for (int i = 0; i < 10; i++) {
            System.out.print("JAVA ");
        }
    }
}
